{"algorithm_description":{"input_variable_name":"The name of the variable that is input into the algorithm as it is named in the data.","input_variable_long_name":"The expanded name of the input variable.","input_variable_unit":"The unit used to report the input variable.","output_variable_name":"The name of the variable that is output from the algorithm as it is named in the data.","output_variable_long_name":"The expaded name of the output variable.","output_variable_unit":"The unit used to report the output variable.","scientific_theory":"A description of the principles essential to the product retrieval including a descripiton of the physics and assoicated geophysical phenomenom observed.","scientific_theory_assumptions":"A description of any scientific or physical assumptions made in deriving the algorithm.","mathematical_theory":"A description of the mathematical theory essential to algorithm development.","mathematical_theory_assumptions":"A description of any mathematical assumptions, simplifications and approximations made when deriving the algorithm."},"algorithm_implementation":{"implementation_url":"The direct access mechanims to the algorithm implementation source code.","implementation_description":"Relevant information needed to execute the algorithm implementation. May include, but not be limited to, execution instructions, memory requirements, programming languages and dependencies.","access_input_url":"Algorithm input data access URL.","access_input_description":"Description of the data access method. Provides context on how to access the data.","access_output_url":"Algorithm output data access URL.","access_output_description":"Description of the data access method. Provides context on how to access the data.","access_related_url":"Alternative data access mecanisims including links to machine services, ordering services and DAAC websites.","access_related_description":"Description of the alternative data access method provided."},"algorithm_usage":{"constraints":"Description of constraints or limitations on use of the algorithm output data.","validation_methods":"Description of the scientific methods utilized for algorithm validation. Details provided should match the current algorithms maturity.","validation_uncertainties":"Description of errors applicable to the validation method. This may include uncertainty in scientific or mathematical methods and/or errors associated with observation retrievals.","validation_errors":"Results of the algorithm validation including statistical relations between the algorithm output and the implemented validation."},"contact_information":{"contact":"TBD.","person_role":"The role of the contact person.","person_first_name":"First name of the contact person.","person_middle_name":"Middle name of the contact person.","person_last_name":"Last name of the contact person.","person_uuid":"Universally unique identifier of the contact person.","person_related_url":"URL relevant to contacting the contact person.","person_mechanism_type":"The method for contacting the responsible party.","person_mechanism_value":"The contact value associated with the contact method.","group_role":"The role of the contact group.","group_name":"The contact group name.","group_uuid":"Universally unique identifier of the contact group.","group_related_url":"URL relevant to contacting the contact group.","group_mechanism_type":"The method for contacting the responsible party.","group_mechanism_value":"The contact value associated with the contact method."},"identifying_information":{"title":"The descriptive formal title of the ATBD.","doi":"The DOI that identifies the ATBD.","doi_authority":"The organization that is responsible for creating the DOI.","citation_creators":"The individual or group that authored the ATBD.","citation_editors":"The individual or group responsible for publishing the ATBD.","citation_title":"The individual or group responsible for publishing the ATBD.","citation_series":"The name of the series for which the ATBD is part of.","citation_release_date":"Release date of the ATBD.","citation_release_place":"The name (city if possible) of the place from which the ATBD was released.","citation_publisher":"The name of the individual or group that made the ATBD available for release.","citation_version":"The version number of the ATBD.","citation_issue":"The issue number of the ATBD.","citation_additional_details":"Additional free-text citation details.","citation_online_resource":"The URL of the ATBD landing page."},"introduction":{"introduction":"A brief description of the ATBD. Concisely provider users with the information needed to understand the relevance and usefulness of the ATBD.","historical_perspective":"TBD."}}